//
//  BataDataBase.swift
//  Maqal
//
//  Created by Maxim Tvilinev on 12.10.2023.
//

import Foundation

// MARK: - Bata

var bataDataBase = [
    BataThemesModel(
        image: "Adam",
        title: "Дастархан",
        bataTitle: [
            BataModel(title: "Дастарханың тоқ болсын, \nУайым-қайғы жоқ болсын! \nЖарды болсаң жасыма, \nБай болсаң, тасыма! \nБақ-дәулет берсін басыңа, \nҒұмыр берсін жасыңа. \nБәле-жала, жын-шайтан, \nЖоламасын қасыңа! \nИманның байлығын берсін, \nҚұт-берекенің бәрі келсін!"),
            BataModel(title: "Құдай жарылқасын, \nБақ қарасын, \nҚыдыр дарысын! \nАйдан аман, \nжылдан есен \nҮйдегі, \nМал-басты аман \nӘумин!"),
            BataModel(title: "Дастарханың майлы, \nКөңілің жайлы \nӨміріңе не \nТілегің қабыл болсын!"),
            BataModel(title: "Жарылқа, құдай, қабыл \nЖарылқаудың қамын \nБай ет, мамыр \nБатамды мұстажап \nҚұдайдан не \nСоны әзір ет! \nҚұдай тағала, мұның  \nҚабыл ет! Әумин!"),
            BataModel(title: "Баға алмастай малды \nЖалшы менен \nӘбүйір берсін \nДәулет берсін \nӘумин!"),
            BataModel(title: "Бір құдайым \nОң жолыңа \nҮйіңді түрлі \nҚұса-қайғыдан \nҮміт артқан ұл \nЕл сенімін \nАумин!"),
            BataModel(title: "Аумин десең \nҚұдай берсін \nАлтыннан – \nКүмістен – \nОң жағыңнан \nКүрпілдек қара \nЖортсаң жолың \nЖолдасың қыдыр \nТілеуің \nМұратың асыл \nІшкенің \nЖегенің \nКигенің түлкі \nЖүрген жерің ойын-күлкі болсын!"),
            BataModel(title: "Қозыға толсын \nТұлпар болсын \nҚұтты болсын \nСүтті болсын \nҚияқты болсын \nТұяқты болсын \nӨрісті болсын \nЫрысты болсын \nАрыстандай болсын \nАюдай болсын \nГүлге толсын \nКөңілді өтсін \nАсқа толсын \nАшық болсын қабағың!"),
            BataModel(title: "Шайың қызыл \nҒұмырың ұзын \nНесібең таса \nДұшпаның қаша \nҚұдайым ұзақ ғұмыр жаза берсін!"),
            BataModel(title: "Пейіліңе \nБата берем қолың \nАқ жарылған \nҚабыл болсын \nБізге сойдың семіз \nТөрт түлігің болсын \nӨсіп-өніп \nТөрт қиырға қанат \nБізге сойдың \nЖақсыдан болсын \nӨміріңді \nӨзіңнен өте тусын \nБізге сойдың \nАлдыңнан тарқат \nСыйлы болып \nСыбағаңды ал \nБізге сойдың \nҮйіңнен кетпесін \nҚызығына \nІшпей-жемей \nБізге сойдың \nЕліңнің бұл \nАбырой алып ұл-\nБиік болсын шоқтығы!"),
            BataModel(title: "Бізге астың \nБерсін саған ұзақ \nАуыздықтап \nАсудан асуға \nБізге астың \nЖақсымен бол \nЫқыласың қабыл \nЫрысың толмай \nБізге астың \nЖамандық көрме сірә \nҚиянат қылма \nЖағамын десең \nБізге астың \nБолдық сізге \nАқ май ақсын \nҮзілмей қорың қысы-\nБізге астың \nӨмірдің болсын \nБолсаң да төлдің \nЖұртыңның болма \nБізге астың \nБасыңа бітсін дүние-\nАта-анаңды \nАяқ-қолын жылы суға \nБізге астың \nПәле-жалаға \nӨрісің барда өрге \nӨз-өзіңнен \nБізге астың \nКөргенің болсын \nАққу-қаздай \nАйдыныңда \nБізге астың \nБаланың берсін \nІзет көріп \nҮзілмесін \nБізге астың \nҚырсығың жерге енсін \nКүндегенді \nКүннен-күнге \nБізге астың \nҮрім-бұтағыңмен \nЖайланып \nЖазылып көш!"),
            BataModel(title: "Уа, жаратқан ием \nТілегімді қабыл \nИманымды кәміл \nАстарыңыз дәмді \nКөңілдеріңіз \nСіңімді болып \nҰрттарыңыз \nШаңыраққа құт \nҚиындықтар \nБақ-береке бір \nҚуаныш тапсын \nӨмірлеріңіз жайлы \nҚанаттарыңыз \nАлла өзі жар \nБар жақсылық \nШырайлы, шаттық күнің \nСәттілік тапсын \nДендерің сау, аман \nАру-сырқау \nӘрбір үйді \nЖаратқан ием \nӘумин!"),
            BataModel(title: "Уа, жаратқан ием \nТілегімді қабыл \nИманымды кәміл \nАсқа бата \nҚолдарыңды \nМаржан сөзді \nЖаратқаным қабыл \nАстарыңыз дәмді \nАсқазаның \nОсында отқан \nӘр күннен бақыт \nБастарыңа бақ \nҚастарыңнан \nКөтеріңкі сәт \nШамнан шырақ \nАбыройлы ат \nБарлық адам \nБолсын деймін \nАлыс кетсе \nБолсын деймін \nМұңая қалсақ \nШаңыраққа құт \nБақ-береке \nАман болсын \nШешімді бір \nКөңіліміз тоқ \nҚайғы-мұңнан арылар!"),
            BataModel(title: "Уа, жаратқан ием \nТілегімді қабыл \nИманымды кәміл \nДастарханың молға \nАппақ айран, \nБар жақсылық орнасын \nБақ-береке, \nОтбасының амандығын \nБала-шағаның адалдығын \nДендеріңе саулық \nӘрбір іске жарамдығын \nСіңімді боп ішер \nДастарханның байлығын \nШаңырағың шаттыққа \nӨмір саған жайлығын \nБала-шағаң аман \nҚуанышқа сай күнін \nАуру-сырқау аулақ \nЖайма-шуақ ай, күнін \nӘумин!"),
            BataModel(title: "Уа, жаратқан ием \nТілегімді қабыл \nИманымды кәміл \nАқ дастархан \nҚойылды ас \nСіңімді болсын \nАғайын-туыс, \nҚуаныштар \nБақ-береке \nОсындағы \nОтбасыңыз аман \nСәтті басар қадам \nЖүріңдерші ән \nШаңыраққа \nБақ-береке мол \nДастарханың бай \nҮсті толған ақ \nҚуанышқа \nДастарханың көп \nӘрқашанда \nАлла саған жақ \nБастарыңа \nТаусылмайтын бақ \nАман болып \nБар жақсылық тап \nӘумин!"),
            BataModel(title: "Уа, жаратқан ием \nТілегімді қабыл \nИманымды кәміл \nДастарханның байлығын \nОтбасының жайлығын \nАстарыңыз сіңімді \nКүлімдеп шығар ай, күнін \nИманымыз \nЖиғанымыз \nОтбасымыз аман \nЖұлдызымыз \nАта берсін таң \nАмандықта ден сау \nАқ батамыз қабыл \nБасымызға бақыт \nӘумин!"),
            BataModel(title: "Ет – Сізден, \nЫқылас, ниет \nТілеуі ақты \nМұратына \nЖақсы-жаманды көріп \nБар мен жоққа көніп \nАщы-түщыны татып \nТайыз-тереңді батып \nЕл басына түскен \nТүз кешіп, түн қатып \nЖиынды топқа \nЖүйрігің баптаулы \nЖігітің мақтаулы \nЖортуыл, жорық \nНайзаң саптаулы \nНөкерің сақтаулы \nДастарханың тоқ \nУайым-қайғы жоқ \nАман \nАбырой \nЖорытқанда жолың болсын!"),

        ]),
]
