//
//  BataDataBase.swift
//  Maqal
//
//  Created by Maxim Tvilinev on 12.10.2023.
//

import Foundation

// MARK: - Bata

let aboutBata = "Бата - это обряд, при котором человек получает благословение от старших членов семьи или общины"

var bataDataBase = [
    BataThemesModel(
        image: "Other",
        title: "Әртүрлі тақырыптар",
        bataTitle: [
            BataModel(title: "Төле би бабамыздың Қойгелді батырға берген батасы\n\nЖүрген жерің жаз болсын,\nАйдыныңа қаз қонсын.\nҰйқың-күлкің аз болсын,\nМерейің мақтанып,\nЕлің-жұртың мәз болсын.\nЖая берген жапырақ,\nАтсын таңың жарқырап.\nӘумин!"),

            BataModel(title: "Райымбек батырдың төртінші ұрпағы Ақбиев Досжан ақсақалдың батасы\n\nХалқымды даласымен сақтасын,\nЖігітті панасымен сақтасын.\nЖаманды анасымен сақтасын,\nАдамды өз бағасымен сақтасын.\nЕлдігіміз нығайып, өсіп-өнейік.\nБір Алла, бізді өзі жақтасын!\nӘумин!\nҰлыстың ұлы күнінде\nДәулетті бақ берсін\nБақытты ас берсін,\nҰлың оңға қонсын\nҚызың қырға қонсын!\nМалың өріске толсын,\nДәулетіңді асырсын\nДұшпаның басылсын.\nМенің берген бұл батам –\nҰлыс күнге сақтап жүрген сүр батам.\nҚұдайым малды қыл,\nТең – құрбының алды қыл!\nҚас сағынған кісіні\nҚасқа шұнақ жарлы қыл!"),

            BataModel(title: "Жас түскен келінге бата беру Отша лаула, сөнбегін,\nЕш жамандық көрмегін.\nҚосағыңмен қоса ағар,\nҚұтты болсын қадамың,\nКелін болдың, қарағым.\nСалтын ұста, ардақта,\nҮлкен ата-бабаңның.\nОшақтан от кетпесін,\nҮйіңнен көп кетпесін,\nАдал болғын жарыңа,\nЛаула, оттай, жалында!\nАумин!"),

            BataModel(title: "Ахмет Байтұрсыновтың берген батасы\n\nҚұдайым жарылқасын, бай қылсын!\nТөрт түлігін сай қылсын!\nКетпес дәулет!\nКең пейіл берсін!\nҚұрбандығың қабыл болсын!\nТілеген тілегіңді берсін!\nАллаһу ақбар!\nАсың, асың, асыңа!\nБереке берсін басыңа!\nБөденедей жорғалап,\nҚырғауылдай қорғалап,\nҚыдыр келсін қасыңа.\nСенен байлық өтпесін!\nТәңірі берген несібең\nТепкілесең кетпесін!\nЖеліңнің екі шетіне\nТай шаптырса жетпесін!\nКешке келіп жамырасқан,\nШуылдасып маңырасқан,\nҚошқанның енесі\nАллаһу ақбар!\nУа, құдайым қолдасын,\nЖіберсін пейіл – жолдасын.\nӨмірлерің ұзақтан,\nКөгендерің тұсақтан болсын,\nАлдыңа береке,\nБақ-дәулетің шашылып жатсын,\nҚазаның асылып жатсын.\nПеріштелер қорғай жүрсін,\nҮйің қонақтан арылмасын,\nҚұдайым пейіл-тілегіңді жарылқасын!\nӘумин!"),

            BataModel(title: "Соқыр Абыздың батасы\n\nБай бол, барша мұратыңа жет,\nҮбірлі-шүбірлі бол.\nҚобыландыдай немере ұлың болсын,\nҚұртқадай ақылды қызың болсын.\n«Қырықтың бірі – Қыдыр» деген.\nОсы лебізімді байтақ әулие қолдап,\nПеріште әумин десін! \n ______________ \n Қуаныш қайырлы болсын,\nЖастар абыройлы болсын.\nУайымдары жоқ болсын,\nКөңілдері тоқ болсын,\nАдал еңбек арқасында,\nТабыстары мол болсын,\nАлақандары ашық болсын,\nӨмірге машық болсын!\nКүйбең қағып кейін қалмай,\nЖаңалыққа ғашық болсын,\nҰрпақтары ер болсын,\nКемеңгерлермен тең болсын.\nОларды көре алмағандардың,\nБедел-берекеті кем болсын.\nӘумин! \n ______________ \n Уа, отау иесі,\nҚолдасын тәңір киесі,\nИнабатың игілікке бастасын,\nПейілің жамандыққа баспасын.\nОшағыңның оты сөнбесін.\nАрың мен жаның арамдыққа көнбесін,\nБосағаң берік болсын,\nҚосағың жерік болсын,\nКөңілің ашық болсын,\nӨмірің нәсіп болсын.\nЖақсының қадірін біл,\nКәрінің әділін біл.\nӨнегеңді қазық ет,\nАқылыңды азық ет,\nСағың сынбасын,\nБағың нұрлансын.\nОйың көсем болсын,\nСөзің шешен болсын.\nОсының бәрі –\nСөзімнің нәрі, Құдайымның құлағына шалынып,\nТілеуім қабыл болсын!\nӘумин! \n ______________ \n Тәңірі жас жұбайларды,\nШат өмірмен жарылқасын.\nБақыттары арылмасын,\nЕшқашанда мұқтаждық көріп,\nЕш адамға жалынбасын,\nЖастары жүзге жеткенше,\n«Дерттімін» деп шағынбасын!\nӘумин!"),

            BataModel(title: "Асарың асқар тау болсын,\nЖүзерің мұхит, көл болсын,\nСүйенерің ел болсын,\nДұшпаның қара жер болсын.\nАбайдай ән,\nЖамбылдай сән,\nҚажымұқандай күш болсын,\nҰрпақ ұмытпас іс болсын.\nЕсігің алды ой болсын,\nОй толған қой болсын.\nКүнде ауылыңда той болсын.\nЖақсыға елікте,\nЖаманға желікпе.\nӘрдайым шабытты бол,\nСарқылмас бақытты бол!\nӘумин!"),

            BataModel(title: "Қанжығалы Асаубайдың батасы \n\n Көтер білекті,\nБерсін тілекті.\nӘуелі Құдай оңдасын,\nӘжді-әулие қолдасын.\nҚызыр менен қырық шілтен,\nПірің болсын жолдасың,\nАсада жұртқа барғанда,\nҚадірлі болсын өз басың,\nСегіз інген боталап,\nСексен саулық қолдасын.\nСегіз келін қомдасын!\nСені көздеген дұшпанды\nБір Алла өзі жондасын.\nДәрежең аса берсін,\nСені көздеген дұшпанды\nПәлекет баса берсін.\nАллау жар болсын,\nФатикам қабыл болсын,\nКеткенің келіп,\nКемтігің толсын! \n ______________ \n Жас баланың күлкісін бер,\nЖас ананың ұйқысын бер.\nЖомарттың қолын бер,\nЖорытқанның жолын бер.\nҚыздың қылығын бер,\nСудың тұнығын бер,\nАсаудың арынын бер,\nТүнгі оттың жарығын бер.\nАсқар таудың паңдығын бер,\nБұлбұл құстың таңғы үнін бер.\nДаланың жазықтығын бер,\nГүлдің нәзіктігін бер.\nТеңіздің тереңдігін бер,\nҚыранның көрегендігін бер.\nЕрдің көңілін бер,\nБүркіттің жігерін бер.\nЛашынның жүрегін бер,\nНағыз достың тілегін бер.\nМәңгі-бақи ажырамас,\nШын ғашықтың тілегін бер!\nӘумин! \n ______________ \n Құдай жарылқасын,\nБақ қарасын,\nҚыдыр дарысын!\nАйдан аман,\nЖылдан есен қылып,\nҮйдегі, түздегі,\nМал басты,\nАман қылсын!\nАллаһу ақбар! \n ______________ \n Дастарқаның тоқ болсын,\n Уайым-қайғың жоқ болсын!\n Бақ-дәулет берсін бастарыңа,\n Ғұмыр берсін жастарыңа!\nПәле-жала, жын-шайтан,\n Жоламасын қастарыңа!\nАллаһу ақбар!"),

            BataModel(title: "Бекентай пірәдардың батасы \n\n Алтыннан болсын жағаң,\nКүмістен болсын тағаң.\nТасқа тары өнгенше,\nТаршылық көрмеңдер.\nМұзға бидай өнгенше,\nМұңшылық көрмеңдер!\nЖүздерің жайнап,\nКелісті болыңдар,\nТолған айдай,\nӨрісті болыңдар!\nҚатарларыңнан озыңдар,\nҚоздаған шоқтай қозыңдар!\nЕң алдымен,\nБерекешіл болыңдар!\nКөкорайдай желкілдеп,\nЖелпілдеп тұрыңдар!\nСексенге келіп,\nСелкілдеп тұрыңдар!\nӘумин!"),

            BataModel(title: "Жас келінге бата \n\n Жетегің бұйда болсын,\nАрқаның шуда болсын.\nБеретін асың болсын,\nКөретін жасың болсын.\nБесігің алдыңнан түспесін,\nБасыңнан жақсылық кетпесін,\nЖамандық саған жетпесін!\nӘумин!"),

            BataModel(title: "Қыз балаға бата (Фариза Оңғарсынова) \n\n Талдай бой берсін\nСұңғыла ой берсін,\nЖаздай жамал берсін,\nҚардай жанар берсін!\nАнаға шуақ болсын,\nАғаға қуат болсын,\nНәзік жаны болсын,\nЕлінің ары болсын,\nБасына өнердің бағы қонсын,\nАқ орданың шамы болсын!"),

            BataModel(title: "Жас жұбайларға, үйлену тойда бата беру \n\n Сөзімнің пәктігін берсін, \nКөңілдің ақтығын берсін, \nЖылулы отбастарыңа\nСәбидің шатты үнін берсін!\nПейілдерің тарылмасын,\nЕсіктерің жабылмасын,\nШаршап-шалдыққандар,\nТөрлеріңе дамылдасын!\nКөлденең кеселден сақтасын,\nКүңкіл өсектен сақтасын,\nДау-жанжалдан сақтасын,\nДостан көңіл қалғаннан сақтасын!\nШайтанның азғыруынан,\nЕлдің жазғыруынан сақтасын,\nАсып-тасқаннан сақтасын,\nАлшаң басқаннан сақтасын!\nОтауларың елге сән болсын!\nӨмірлерің бал болсын,\nБибі Фатима анамыздың аруағы\nӨздеріңе жар болсын!\nӘумин!"),

            BataModel(title: "Ұл балаға берілетін бата \n\n Жүсіптің дидарын берсін,\nМұхамедтің иманын берсін.\nЖаныңа даланың кеңдігін берсін,\nӘзірет ердің ерлігін берсін.\nАбылайдың байрағын берсін,\nБауыржан батырдың айбарын берсін!\nЕліңе ырыс-құт орнасын,\nЖеріңе тыныштық орнасын!\nӨсек-аяңның құрбаны болмасын,\nОзбырлардың шұлғауы болмасын!\nАлыс жолдарға,\nҚолың орманда,\nТайғанақ құздарда\nКөлденең келер қазадан,\nЖазықсыз төнген жазадан\nӘулие-әмбилер қорғасын,\nАта-бала, аруақ қолдасын!\nӘумин!"),
            BataModel(title: "Дәмге бата \n\n Әуелі Құдай есен ет,\nЖиреншедей шешен ет.\nАтымтайдай көсем ет,\nЛұқпандай береген ет.\nИбраһимнің бақытын берсін,\nСүлейменнің тақытын берсін,\nҚыдыр құсы қонсын қасыңа,\nБұлбұл құсы қонсын басыңа.\nЖорытқанда жолың болсын,\nЖолдасың қызыр болсын.\nЖоғары болсын жұлдызың,\nБақытты болсын ұл-қызың.\nАс иесі байысын,\nБар ойлаған арманың,\nЖақсылыққа сыйынсын!\nАллаһу ақпар!"),

            BataModel(title: "Сақтық батасы \n\n Уа, құдайым, тілегімді қабыл ет,\nИманымды кәміл ет.\nТозақта жанған оттан сақта,\nҚаңғырып тиген оқтан сақта.\nПарақор соттан сақта,\nКірлі сумен жуыстан сақта,\nЫнтымақсыз туыстан сақта,\nҚаражүрек бақылдан сақта.\nКөк дауыл қатыннан сақта,\nКеудесін керген келіннен сақта.\nМезгілсіз келген өлімнен сақта,\nҰятсыз қызыңнан сақта.\nТүнеріп атқан таңнан сақта,\nЖаңбырсыз болған жазыңнан сақта,\nҚарсыз мұздақ қысыңнан сақта.\nЖастарында әдеп жоқ,\nҚұр айғай, шуыңнан сақта.\nАлдыңнан бақытың ашылсын,\nҚызыр Ілияс барарлық пәлені қашырсын.\nАллаһу ақбар!"),

            BataModel(title: "Тойға бата \n\n\nӘуелі, Құдай оңдасын,\nХақ Расул жәрдем қып,\nӘулиелер қолдасын.\nСапар шықсаң, басшы боп,\nҚызыр болсын жолдасың.\nШүкірлік қыл Аллаға,\nПейіліңді Құдай алмасын.\nТәубе қылып жүріңіз,\nІриядан болмасын.\nТауфиқ берсін бір Алла,\nАрамға ауырың салмасын.\nБақытты болсын ұл-қызың!\nЖоғары болсын жұлдызың!\nРиза болсын мейманың,\nОрнынан келер жиғаның,\nТаңда махшар болғанда,\nАлдыңнан шығар бергенің,\nКөпшіліктен бата алсаң,\nМұратыңа жетесің.\nЖомарттық қылсаң тірлікте,\nҚуанышпен өтерсің.\nҚабыл болғай батамыз,\nКешіре гөр, Алла, қатамыз.\nПәлені дұға қайтарар,\nБұрынғыны айтамыз.\nЫқыласқа тойдың біз,\nШақырған соң келдік біз,\nКелмек – сүннәт,\nҚайту – парыз,\nТойыңыз тойға ұлассыз,\nКелген ізбен қайтамыз.\nАллаһу ақбар!"),

            BataModel(title: "Келін той батасы \n\n\nЖас келіннің батасы,\nЖастардың көп қатасы.\nЖек көрмейді баласын,\nАнасы мен атасы.\nБалалар, көтер қолыңды,\nҚайырлы құтты жолыңды.\nИем берсін мал мен бас,\nТолтырсын оң мен солыңды.\nМен берейін батамды,\nКішіпейіл бол, келінжан,\nСыйла енең мен атаңды.\nКекшіл болма, қарағым,\nКешірер әркім қатаңды.\nБола берсін ойын-той,\nҚызықтырып тойлау – құрмет қой.\nАқыл, естен айырмай,\nЖастарым еске алып қой,\nҚайырлы болсын тойыңыз,\nҚұдалар кеуде соқтырып,\nҚұйрық, бауырға тойыңыз!\nАллаһу ақбар!"),

            BataModel(title: "Той жасаған үй иесіне берілетін бата \n\n\nҚұрметті той иесі,\nІсіңді тағдыр оңдасын,\nҚайда жүрсең қолтықтап,\nҚыдыр бабаң қолдасын!\nЖамбылға ұқсап көп жаса,\nДенеңде дерт болмасын,\nТойың-тойға ұласып,\nЖан-жүрегің толғансын,\nКүннен-күнге көбейсін,\nДос-жараның, жолдасың.\nБақытың тассын әманда,\nБергенін тәңірі алмасын!\nӨміріңді ұзартып,\nБалаң менен немерең,\nШөберең мен шөпшегің,\nТуажаттар жалғассын!"),

            BataModel(title: "Жас бөбекке берілетін бата \n\n\nКөтерейік білекті,\nНұрға бөлеп жүректі.\nБөбекке бата берейік,\nАғынан айтып тілекті.\nСәбиіміз сүйкімді болсын,\nӨнер-білімге икемді болсын,\nБәйтеректей бойшаңданып,\nӨнер, өршіл, өркенді болсын,\nЖақсы жолды таңдасын,\nЖамандық тәлім алмасын,\nДаналардың дәстүрін,\nЖаңаласын – жалғасын.\nШұғылалы шуақ күн кешсін,\nБасын сұр бұлт шалмасын,\nҚос топшысы талмасын,\nҚырандай биік самғасын.\nАры адал, жаны жаз,\nҚұрбысынан қалмасын!\nАбай, Жамбыл, Міржақып,\nШоқан, Ахмет, Мағжандай\nТасқа басқан таңбасын,\nМәңгілік артына із қалдырсын!\nӘумин!"),

            BataModel(title: "Шілдехана тойында берілетін бата \n\n\nАнасының аяулы\nЖарып шыққан кемерін,\nҚадам басып өмірге,\nЖас шыбықтай бүр жарып,\nЖаңа жайған желігін,\nТорсық шеке, ақмаңдай,\nӨсе берсін бөбегің.\nӨмірі ұзақ болсын деп,\nКөңілі нұрға толсын деп,\nАқ батамды беремін.\nАзамат боп ер жетсін,\nҚиын кезде жолдастан\nАямайтын көмегін.\nТойың тойға ұласын,\nБола берсін дегенің,\nАллһу ақбар!"),
        ]),

    BataThemesModel(
        image: "Dastarhan",
        title: "Дастархан",
        bataTitle: [
            BataModel(title: "Дастарханың тоқ болсын, \nУайым-қайғы жоқ болсын! \nЖарды болсаң жасыма, \nБай болсаң, тасыма! \nБақ-дәулет берсін басыңа, \nҒұмыр берсін жасыңа. \nБәле-жала, жын-шайтан, \nЖоламасын қасыңа! \nИманның байлығын берсін, \nҚұт-берекенің бәрі келсін!"),
            BataModel(title: "Құдай жарылқасын, \nБақ қарасын, \nҚыдыр дарысын! \nАйдан аман, \nжылдан есен қылып,\nҮйдегі, түздегі\nМал-басты аман қылсын!\nӘумин!"),

            BataModel(title: "Жарылқа, құдай, қабыл ет!\nЖарылқаудың қамын ет!\nБай ет, мамыр ет,\nБатамды мұстажап ет!\nҚұдайдан не тілесе,\nСоны әзір ет!\nҚұдай тағала, мұның ақниетін\nҚабыл ет! Әумин!"),

            BataModel(title: "Баға алмастай малды бол!\nЖалшы менен құлыңа,\nӘбүйір берсін қызыңа,\nДәулет берсін ұлыңа!\nӘумин!"),

            BataModel(title: "Бір құдайым оңдасын,\nОң жолыңа бастасын!\nҮйіңді түрлі апаттан,\nҚұса-қайғыдан сақтасын!\nҮміт артқан ұл қызың,\nЕл сенімін ақтасын!\nАумин!"),

            BataModel(title: "Аумин десең маған,\nҚұдай берсін саған.\nАлтыннан – жағаң,\nКүмістен – тағаң.\nОң жағыңнан кетпесін\nКүрпілдек қара сабаң.\nЖортсаң жолың болсын,\nЖолдасың қыдыр болсын.\nТілеуің қабыл,\nМұратың асыл болсын.\nІшкенің қымыз,\nЖегенің сырбаз,\nКигенің түлкі болсын,\nЖүрген жерің ойын-күлкі болсын!"),

            BataModel(title: "Қозыға толсын көгенің,\nТұлпар болсын көгенің.\nҚұтты болсын құрығың,\nСүтті болсын құдығың.\nҚияқты болсын сұңқарың,\nТұяқты болсын тұлпарың.\nӨрісті болсын жайлауың,\nЫрысты болсын қыстауың.\nАрыстандай болсын айбатың,\nАюдай болсын қайратың.\nГүлге толсын өңірің,\nКөңілді өтсін өмірің.\nАсқа толсын табағың,\nАшық болсын қабағың."),

            BataModel(title: "Шайың қызыл болсын,\nҒұмырың ұзын болсын.\nНесібең таса берсін,\nДұшпаның қаша берсін,\nҚұдайым ұзақ ғұмыр жаза берсін!"),

            BataModel(title: "Пейіліңе қонақжай\nБата берем қолың жай:\nАқ жарылған жүрегің,\nҚабыл болсын тілегің.\nБізге сойдың семіз тай,\nТөрт түлігің болсын сай.\nӨсіп-өніп ұрпағың,\nТөрт қиырға қанат жай!\nБізге сойдың құлын,\nЖақсыдан болсын жұғым.\nӨміріңді ұзартып,\nӨзіңнен өте тусын ұлың.\nБізге сойдың марқаны,\nАлдыңнан тарқат арқаны.\nСыйлы болып еліңе,\nСыбағаңды ал тағы.\nБізге сойдың қой,\nҮйіңнен кетпесін той.\nҚызығына қанып,\nІшпей-жемей той.\nБізге сойдың тоқтыны,\nЕліңнің бұл тоқтығы.\nАбырой алып ұл-қызың,\nБиік болсын шоқтығы."),

            BataModel(title: "Бізге астың бас,\nБерсін саған ұзақ жас.\nАуыздықтап асауды,\nАсудан асуға ас!\nБізге астың жамбас,\nЖақсымен бол жандас.\nЫқыласың қабыл боп,\nЫрысың толмай қалмас.\nБізге астың сыбаға,\nЖамандық көрме сірә да.\nҚиянат қылма пендеге,\nЖағамын десең құдаға.\nБізге астың қазы,\nБолдық сізге разы.\nАқ май ақсын аузыңнан,\nҮзілмей қорың қысы-жазы.\nБізге астың жаяны,\nӨмірдің болсын баяны.\nБолсаң да төлдің жылқысы,\nЖұртыңның болма саяғы.\nБізге астың жал,\nБасыңа бітсін дүние-мал.\nАта-анаңды ардақтап,\nАяқ-қолын жылы суға мал.\nБізге астың омыртқа,\nПәле-жалаға жолықпа.\nӨрісің барда өрге шап,\nӨз-өзіңнен торықпа.\nБізге астың шұжық,\nКөргенің болсын қызық.\nАққу-қаздай мамырла,\nАйдыныңда жүзіп.\nБізге астың жауырын,\nБаланың берсін тәуірін.\nІзет көріп ініден,\nҮзілмесін сауығың.\nБізге астың сүбе,\nҚырсығың жерге енсін түге!\nКүндегенді күңірентіп,\nКүннен-күнге үде.\nБізге астың төс,\nҮрім-бұтағыңмен өс!\nЖайланып қон,\nЖазылып көш!"),

            BataModel(title: "Уа, жаратқан ием құдірет\nТілегімді қабыл ет!\nИманымды кәміл ет!\nАстарыңыз дәмді боп,\nКөңілдеріңіз жайлансын!\nСіңімді болып асыңыз,\nҰрттарыңыз майлансын!\nШаңыраққа құт еніп,\nҚиындықтар болмасын!\nБақ-береке бір келіп,\nҚуаныш тапсын жалғасын!\nӨмірлеріңіз жайлы боп,\nҚанаттарыңыз талмасын!\nАлла өзі жар болып,\nБар жақсылық орнасын!\nШырайлы, шаттық күнің боп,\nСәттілік тапсын жалғасын!\nДендерің сау, аман боп,\nАру-сырқау болмасын!\nӘрбір үйді әрдайым,\nЖаратқан ием қолдасын!\nӘумин!"),

            BataModel(title: "Уа, жаратқан ием құдірет\nТілегімді қабыл ет!\nИманымды кәміл ет!\nАсқа бата берейін,\nҚолдарыңды жайыңдар!\nМаржан сөзді терейін,\nЖаратқаным қабыл ал!\nАстарыңыз дәмді болсын,\nАсқазаның қабылдар!\nОсында отқан көпшілік,\nӘр күннен бақыт табыңдар!\nБастарыңа бақ қонсын,\nҚастарыңнан табылар!\nКөтеріңкі сәт болсын,\nШамнан шырақ жағылар!\nАбыройлы ат болсын,\nБарлық адам қабылдар!\nБолсын деймін сыйластық,\nАлыс кетсе сағынар!\nБолсын деймін қимастық,\nМұңая қалсақ қамығар!\nШаңыраққа құт келсін,\nБақ-береке табылар!\nАман болсын отбасы,\nШешімді бір қабылдар!\nКөңіліміз тоқ болсын,\nҚайғы-мұңнан арылар!"),

            BataModel(title: "Уа, жаратқан ием құдірет\nТілегімді қабыл ет!\nИманымды кәміл ет!\nДастарханың молға жайылсын,\nАппақ айран, сүтімен.\nБар жақсылық орнасын тек,\nБақ-береке, құтымен.\nОтбасының амандығын берсін,\nБала-шағаның адалдығын берсін.\nДендеріңе саулық беріп,\nӘрбір іске жарамдығын берсін!\nСіңімді боп ішер асымыз,\nДастарханның байлығын берсін!\nШаңырағың шаттыққа толып,\nӨмір саған жайлығын берсін!\nБала-шағаң аман болып,\nҚуанышқа сай күнін берсін!\nАуру-сырқау аулақ болып,\nЖайма-шуақ ай, күнін берсін!\nӘумин!"),

            BataModel(title: "Уа, жаратқан ием құдірет\nТілегімді қабыл ет!\nИманымды кәміл ет!\nАқ дастархан жайылып,\nҚойылды ас ортаға.\nСіңімді болсын астарың,\nАғайын-туыс, баршаға.\nҚуаныштар орналсын,\nБақ-береке жалғансын,\nОсындағы баршаңа.\nОтбасыңыз аман боп,\nСәтті басар қадам боп,\nЖүріңдерші ән сала!\nШаңыраққа тілейміз,\nБақ-береке мол болсын.\nДастарханың бай болып,\nҮсті толған ақ болсын.\nҚуанышқа жайылар,\nДастарханың көп болсын!\nӘрқашанда қолдайтын,\nАлла саған жақ болсын!\nБастарыңа орнайтын,\nТаусылмайтын бақ болсын!\nАман болып отбасы,\nБар жақсылық тап болсын!\nӘумин!"),

            BataModel(title: "Уа, жаратқан ием құдірет\nТілегімді қабыл ет!\nИманымды кәміл ет!\nДастарханның байлығын берсін,\nОтбасының жайлығын берсін.\nАстарыңыз сіңімді болып,\nКүлімдеп шығар ай, күнін берсін!\nИманымыз сарқылмасын,\nЖиғанымыз таусылмасын.\nОтбасымыз аман болып,\nЖұлдызымыз жарқылдасын!\nАта берсін таң күлімдеп,\nАмандықта ден сау болып.\nАқ батамыз қабыл болсын,\nБасымызға бақыт қонып!\nӘумин!"),

            BataModel(title: "Бізге астың жілікті,\nҰл-қызың болсын білікті,\nБізге астың белдеме,\nСыйлы бол басқа елге де.\nБізге астың кесек ет,\nДәулетің тассын еселеп.\nСыйлап бердің етіңді,\nЖарылқасын бетіңді.\nЕнді әкелдің сорпаңды,\nОрындатсын қолқаңды.\nКелді тағы қымызың,\nАрылмасын қызығың.\nҚойдың қаймақ, айраның,\nАман болсын ауыл-аймағың.\nЖаздың жайма, бауырсақ,\nБола берсін қауым шат.\nЖәне келді құрт-майың,\nТуа берсін құтты айың.\nРақмет дәміңе,\nРизалық берсін бәріңе.\nАман болып басыңыз,\nЖүзге жетсін жасыңыз.\nМаған жаптың шапан,\nКөңілде болмасын қапаң.\nМаған мінгіздің ат,\nҚыз ұзатып, қызығына бат!\nМаған атадың жол,\nҰл өсіріп мәре-сәре бол!\nМаған бердің ет,\nКелін түсіріп, тілегеніңе жет!\nМаған бердің сауға,\nБасың түспесін дауға!\nАлдыма салдың мал,\nАлладан рақмет ал!"),

            BataModel(title: "Ет – Сізден,\nЫқылас, ниет бізден.\nТілеуі ақты тәңірім\nМұратына жеткізген.\nЖақсы-жаманды көріп бақ.\nБар мен жоққа көніп бақ.\nАщы-түщыны татып көр,\nТайыз-тереңді батып көр!\nЕл басына түскен сынды,\nТүз кешіп, түн қатып көр.\nЖиынды топқа түскенде,\nЖүйрігің баптаулы болсын,\nЖігітің мақтаулы болсын.\nЖортуыл, жорық жолықса,\nНайзаң саптаулы болсын.\nНөкерің сақтаулы болсын.\nДастарханың тоқ болсын,\nУайым-қайғы жоқ болсын.\nАман сақтап,\nАбырой берсін!\nЖорытқанда жолың болсын!"),

            BataModel(title: "Ардақты үйдің иесі,\nӘуелі бердің шай,\nКөңілің болсын жай.\nЕкінші бердің ет,\nТаппасын көңілің\nЕшбір дерт!\nҮшінші бердің сорпа,\nБолмасын бағың орта!\nЕкі дүниенің игілігіне жеткізсін,\nЕсіркеп сүйген пендесінен еткізсін!"),

            BataModel(title: "Астырсын, тастырсын,\nЖақсылармен жанастырсын,\nЖамандардан адастырсын,\nОттың басы аман болсын,\nБейбітшілік заман болсын,\nБалаларың азамат адам болсын,\nЖауың жеңіліп қабан болсын!"),

            BataModel(title: "Басыңа Алла бақ берсін,\nНе берсе де нақ берсін,\nБілім нақыл айтуға\nЖалықпайтын жақ берсін!\nАйтып жүрер білімнің\nІс-амалмен шақ келсін!\nБереке-құт пен ырысты\nҮйлеріңе ап келсін!\nҚара ниетті жауыңа\nБәлекеті тап келсін!\nАрман ниетке жеткізіп,\nТілеуіңді ап берсін!\nМал-жан аман тоқ болсын,\nҚайғы-қасірет жоқ болсын!\nДастарханың ақ болсын,\nШаңыраққа бақ қонсын!\nБалаларың көп болсын,\nТамағы тоқ, киімі көк болсын,\nИманы мығым бек болсын,\nСөзі тура дөп болсын!"),

            BataModel(title: "Хак қарасын,\nБақ дарысын.\nДастарханға береке берсін,\nЕлге дәулет-мереке берсін.\nШыққанның есесін берсін,\nҚалғанның берекесін берсін,\nКең пейіл берсін,\nҰзақ өмір берсін,\nОт айнала бас берсін,\nөріс толы мал берсін.\nМал берсе, қайырын берекетімен берсін,\nБас берсе, азық-несібесімен берсін!"),

            BataModel(title: "Ақылыңды астырсын,\nЫқыласыңды тастырсын,\nБалаң үбірлі болсын,\nҚызың шүбірлі болсын!\nЖақын көп болсын,\nЖауың жоқ болсын!\nЖақсы келсін қасыңа,\nНұр жаусын әзіз басыңа!\nКөшің көлікті болсын,\nҚонысың түлікті болсын,\nҚатулықтан аулақ бол,\nТатулыққа жақын бол!\nДәуренің иманмен сәнді болсын,\nҒұмырың біліммен мәнді болсын!"),
        ]),

    BataThemesModel(
        image: "Uylenu",
        title: "Үйлену тойда бата",
        bataTitle: [
            BataModel(title: "Бақытты бол, бағың ашылсын,\nӘр күнің шаттыққа толсын.\nБосағаңа жамандық жетпесін,\nТөріңнен жақсылық кетпесін.\nҰлдарың оншақты болсын,\nҚыздарың моншақты болсын.\nБастарыңа бақ қонсын,\nЖаратқан ием жақ болсын.\nЫнтымақ серік болсын.\nШаңырақтарың биік болсын.\nНесібе-ырыс иіп келсін.\nДастархандарың кең болсын.\nҚызық-қуаныш тең болсын.\nҮй-іштерің мерекелі болсын,\nӨмірлерің берекелі болсын.\nТілектерің ақ болсын,\nМахаббаттарың пәк болсын.\nӘумин!"),
            BataModel(title: "Шаңырақтарың биік болсын,\nБосағаларың берік болсын.\nБау-бақшаларың өрік болсын.\nБасыңда дәйім,\nҚұлпырған құндыз бөрік болсын.\nАқ жүзіңде жарыңның,\nАқ кимешек көрік болсын.\nҚұдай қаласа,\nКөп ұзамай жерік болсын.\nТорсық шекелі ұл тауып,\nОл өзіңе серік болсын.\nӘумин"),
            BataModel(title: "Қос аққудай көлдегі,\nҚызғалдақтай белдегі,\nЖас жұбайлар екенсің,\nБата берем кел бері.\nДәулетті, малды болыңдар,\nЖұқармас жалды болыңдар,\nЕл-жұртың мақтан тұтатын,\nЖастардың алды болыңдар.\nТұтатқан шырақтарыңды,\nБасталған мұраттарыңды,\nБір Алла қолдап әрдайым,\nЖайқалтсын құрақтарыңды.\nОтауларың орда болсын,\nАттарың жорға болсын.\nҚымызың қымызық татып,\nМестерің қорда болсын.\nӘумин"),
            BataModel(title: "Жас келіннің батасы,\nЖастардың көп қатасы.\nЖек көрмейді баласын,\nАнасы мен атасы,\nБалалар, көтер қолыңды,\nҚайырлы құтты жолыңды,\nИем берсін мал мен бас,\nТолтырсын ол мен солыңды.\nМен берейін батамды,\nКішіпейіл болып келінжан,\nСыйла енең мен атаңды.\nКекшіл болма, қарағым,\nКешірер әркім қатаңды.\nБола берсін ойын-той,\nҚызықтап тойлау – құрмет қой.\nАқыл, естен айрылмай,\nЖастарым, еске алып қой,\nҚайырлы болсын тойыңыз,\nҚұдалар кеуде соқтырып,\nҚұйрық, бауырға тойыңыз.\nӘумин"),
        ]),

    BataThemesModel(
        image: "Toy",
        title: "Тойға бата",
        bataTitle: [
            BataModel(title: "Қуаныштың тұрағы бол,\nҰлан істің бұлағы бол.\nМерекенің құрағы бол,\nМейірімнің шырағы бол.\nСабырлылықтың сыңары бол,\nПәк үлгінің шынары бол.\nТуырлықтың тұмары бол,\nТұлғалы ұлттың құмары бол.\nӘумин"),
            BataModel(title: "Атаның наласынан сақтасын,\nБаланың шаласынан сақтасын,\nАғайынның аласынан сақтасын\nЖамандардың жаласынан сақтасын.\nӘумин"),
            BataModel(title: "Құрдасыңа – қуаныш бол,\nСырласыңа – сынық бол,\nЖылағанға жұбаныш бол,\nТуысыңа тұнық бол.\nТатулыққа – тамаша бол,\nЫқыласқа – иық бол,\nАна алдында аласа бол,\nАр алдында биік бол.\nӘумин"),
            BataModel(title: "Абырой бер, аман сақта,\nОттан, судан сақта.\nТілсіз жаудан сақта.\nКүле кіріп,\nКүңірене шыққан дұшпаннан сақта."),
            BataModel(title: "Талмайтын талап берсін,\nСамғайтын қанат берсін.\nБаянды махаббат берсін,\nҰзақ ғұмыр, тұрлаулы бақыт берсін.\nӘумин"),
            BataModel(title: "Бақ келіп қонып басыңа,\nКөңілің көлдей шалқысын.\nПейіліңе тойған қонағың,\nІшпей-жемей балқысын.\nӘумин"),
            BataModel(title: "Уа, Жаратқан, жарылқа,\nБақ-дәулетін аумас қыл!\nАла ауыздан алас қыл,\nҚарғағаннан қалас қыл!\nНиеттері ақ болсын,\nБейнеттері пәк болсын!\nӨрендерің ер болсын,\nОтырғаның төр болсын,\nКөре алмаған бағыңды,\nСындыра алмай сағыңды,\nҚара ниет дұшпаның,\nБетін басып жер болсын!\nҚонысың өрісті болсын,\nЕккенің келісті болсын.\nЕңбегің жемісті болсын!\nЖарың жібектей болсын!\nӨнерің өрлей берсін,\nӨмірің төрлей берсін!"),
            BataModel(title: "Ақылың ассын,\nЫқыласың тассын,\nБалаң үбірлі болсын,\nҚызың шүбірлі болсын,\nЖақының көп болсын,\nДұшпаның жоқ болсын,\nЖақсы келсін қасыңа,\nНұр жаусын басыңа,\nКөшің көлікті болсын,\nҚонысың түлікті болсын.\nҚатулықтан аулақ бол,\nТатулыққа жақын бол.\nДәуренің сәнді болсын,\nҒұмырың мәнді болсын.\nТаңың азанды болсын,\nҮйің қазанды болсын,\nШаңырағыңа құт құйылсын,\nДастарханыңа жұрт жиылсын,\nӘумин"),
        ]),

    BataThemesModel(
        image: "SundetToy",
        title: "Сүндет тойы",
        bataTitle: [
            BataModel(title: "Атың, атың, ату бол,\nАғайынмен тату бол,\nБағаналы таудай бол,\nШағалалы көлдей бол…"),
            BataModel(title: "Ала биең құлындап,\nАлатауға сыймасын,\nҚара биең құлындап,\nҚаратауға сыймасын!\nҮйіңнің алды ой болсын,\nҚораң толы қой болсын,\nІшкенің қатық болсын,\nНесібең артық болсын…"),
            BataModel(title: "Сүндет атың пыраққа айналсын,\nМінген ашамайың таққа айналсын,\nҚоржының толы болсын,\nЫлайым жолың болсын!"),
            BataModel(title: "Пішпең, пішпең, пішпеңде,\nТілек айтам кішкене.\nБақыт қонсын басыңа,\nЖас қосылсын жасыңа,\nБайлық берсін үстеме!"),
        ]),
]
